README.org
#+TITLE: My GNU Emacs Configuration
#+DATE: Wednesday, September 25, 2024
#+PROPERTY: header-args:emacs-lisp :results silent
#+STARTUP: overview
#+auto_tangle: t

* Table of Contents
:PROPERTIES:
:visibility: folded
:TOC:      :include all :depth 1 :ignore this
:END:
:CONTENTS:
- [[#introduction][Introduction]]
- [[#resources][Resources]]
- [[#common-header-for-emacs-libraries][Common Header For Emacs Libraries]]
- [[#early-init-file][Early Init File]]
- [[#init-file][Init File]]
- [[#emacs][Emacs]]
- [[#ui][UI]]
- [[#org-mode][Org-Mode]]
- [[#completion][Completion]]
- [[#dired][DIRED]]
- [[#development][Development]]
- [[#writing][Writing]]
- [[#keybindings][Keybindings]]
- [[#load-modules][Load Modules]]
:END:

* Introduction
:PROPERTIES:
:visibility: folded
:END:

This is my literate Emacs configuration file. It serves as both documentation
and the source for configuring Emacs. All necessary files to configure Emacs
are generated from this file by calling ~org-babel-tangle~ (~C-c C-v t~) and stored
in the =/modules= sub-directory. As such, changes should be made in this
document, not in the individual =.el= files.

* Resources
:PROPERTIES:
:visibility: folded
:END:

The structure and contents of this Emacs configuration was heavily inspired by
a number of individuals. Below is a list of high quality configurations that
are updated with some frequency.

+ [[https://github.com/daviwil/dotfiles][daviwil/dotfiles]]
+ [[https://github.com/karthink/.emacs.d][karthink/.emacs.d]]
+ [[https://github.com/MArpogaus/emacs.d][MArpogaus/emacs.d]]
+ [[https://github.com/angrybacon/dotemacs][angrybacon/dotemacs]]
+ [[https://github.com/gopar/.emacs.d/tree/main][gopar/.emacs.d]]
+ [[https://github.com/dakrone/eos][dakrone/eos]]
+ [[https://github.com/jeremyf/dotemacs/tree/main][jeremyf/dotemacs]]
+ [[https://config.phundrak.com/emacs/][Phundrak/emacs]]
+ [[https://github.com/jwiegley/dot-emacs/blob/master/init.org][jwiegley/dot-emacs]]
+ [[https://github.com/novoid/dot-emacs/blob/master/config.org][novoid/dot-emacs]]
+ [[https://github.com/jackkamm/.emacs.d][jackkamm/.emacs.d]]
+ [[https://github.com/Thaodan/emacs.d][Thaodan/emacs.d]]
+ [[https://github.com/suvratapte/dot-emacs-dot-d/tree/master][suvratapte/dot-emacs-dot-d]]
+ [[https://protesilaos.com/emacs/dotemacs][protesilaos.com/emacs/dotemacs]]
+ [[https://github.com/dakra/dmacs/][dakra/dmacs]]
+ [[https://forgemacs.bharathpalavalli.com/][forgemacs.bharathpalavalli.com]]
+ [[https://github.com/konrad1977/emacs][konrad1977/emacs]]
+ [[https://github.com/PythonNut/quark-emacs][PythonNut/quark-emacs]]
+ [[https://github.com/radian-software/radian][radian-software/radian]]
+ [[https://sachachua.com/dotemacs/index.html][sachachua.com/dotemacs]]
+ [[https://github.com/syohex/dot_files/tree/master/emacs][syohex/dot_files]]
+ [[https://github.com/purcell/emacs.d][purcell/emacs.d]]
+ [[https://github.com/thierryvolpiatto/emacs-config][thierryvolpiatto/emacs-config]]
+ [[https://github.com/xiongtx/.emacs.d][xiongtx/.emacs.d]]
+ [[https://github.com/Wilfred/.emacs.d][Wilfred/.emacs.d]]
+ [[https://panadestein.github.io/emacsd/][panadestein.github.io/emacsd/]]

Other resources that I found helpful include:

+ [[https://sachachua.com/blog/][Sacha Chua: Emacs Summary Blog]]
+ [[https://www.reddit.com/r/emacs/new/][reddit.com/emacs]]
+ [[https://github.com/caisah/emacs.dz?tab=readme-ov-file][github/caisah: Example Configurations]]
+ [[https://idiomdrottning.org/bad-emacs-defaults][Idiomdrottning: Bad Emacs Defaults]]
+ [[https://systemcrafters.net/emacs-from-scratch/the-best-default-settings/][SystemCrafters: Six Emacs Settings Every User Should Consider]]

* Common Header For Emacs Libraries
:PROPERTIES:
:visibility: folded
:END:

Copied from [[https://github.com/MArpogaus/emacs.d/blob/master/emacs.org#common-header-for-emacs-libraries][github.com/MArpogaus]].

#+NAME: header
#+begin_src shell :var FILENAME="init.el" :results output
echo ";;; $FILENAME --- Emacs configuration file  -*- lexical-binding: t; -*-
;; Copyright (C) 2024-$(date +%Y) Jonathan A. Harris

;; Author: Jonathan A. Harris, MSc.
;; Keywords: configuration
;; Homepage: https://github.com/jah377/.emacs.d

;; This file is not part of GNU Emacs.

;;; Commentary:

;; This file has been generated from 'README.org'. DO NOT EDIT.

;; Changes to the configuration should be done in 'README.org' and then
;; re-tangled by calling 'C-c C-v C-t'.

;;; Code:"
#+end_src

* Early Init File
:PROPERTIES:
:header-args: :tangle early-init.el
:END:

The =early-init.el= file, introduced with Emacs27, is the first file that Emacs
reads when starting up. In principal, the early initialization file should
set-up a few basic things before Emacs produces the initial frame, and should
not depend on any packages.

#+begin_src emacs-lisp :noweb yes :comments no
<<header(FILENAME="early-init.el")>>
#+end_src

** Temporarily Configure Garbage Collection
:PROPERTIES:
:ID:       19407840-a20f-4225-9484-bbf88d3ff00d
:END:

=gc-cons-threshold= setting controls the number of bytes required to trigger
garbage collection (GC); =gc-cons-percentage= related. Setting to
~most-positive-fixnum~ effectively disables GC, which significantly affects
startup times.

Values are lowered after startup to prevent freezing or crashing.

*Source:*
+ [[https://github.com/doomemacs/doomemacs/blob/master/early-init.el#L29][github.com/doomemacs/early-init.el]]
+ [[https://github.com/nilcons/emacs-use-package-fast#a-trick-less-gc-during-startup][github.com/nilcons/emacs-use-package-fast#a-trick-less-gc-during-startup]]

#+begin_src emacs-lisp 
(setq gc-cons-threshold most-positive-fixnum)
(setq gc-cons-percentage 0.6)

;; Restore after startup
(add-hook 'emacs-startup-hook
          (lambda ()
            (setopt gc-cons-threshold (* 16 1024 1024))))

;; Perform GC after startup
(add-hook 'emacs-startup-hook (lambda () (garbage-collect))) 
#+end_src

** Disable Frame Resizing

=frame-inhibit-implied-resize= setting, when set to ~t~, prevents Emacs from
automatically resizing the frame during the initialization process.

Configuring visual elements like font or fringes may trigger Eamcs to resize
the frame in order to preserver a number of columns or lines it
displays. Resizing can be a terribly expensive part of changing the font. By
inhibiting this, it is possible to reduce startup times with fonts that are
larger than the system default.

*Source:*
+ [[https://tony-zorman.com/posts/emacs-potpourri.html][A Potpourri of Emacs Tweaks]]
+ [[https://github.com/DamienCassou/emacs.d/blob/master/early-init.el#L25][github.com/DamienCassou]]
+ [[https://github.com/MArpogaus/emacs.d?tab=readme-ov-file#optimize-startup-time][github.com/MArpogaus]]

*IMPORTANT:* This should be configured before [[id:534b1a9a-e956-42b1-bf81-40b4e82b2c8e][Disable UI Elements]] and [[id:1360c936-229c-44fd-b71c-30f66960d23a][UI]] sections

#+begin_src emacs-lisp 
(setopt frame-inhibit-implied-resize t)
#+end_src

Similarly, =frame-resize-pixelwise= setting, when set to ~t~, disables Emacs from
resizing the frame when changing fonts. Doing so /allegedly/ improves startup
times when fonts are larger than the system default.

*Source:*
+ [[https://github.com/jamescherti/minimal-emacs.d/blob/main/init.el][github/jamescherti/minimal-emacs.d]]

#+begin_src emacs-lisp 
(setopt frame-resize-pixelwise t)
#+end_src

** Disable UI Elements
:PROPERTIES:
:ID:       534b1a9a-e956-42b1-bf81-40b4e82b2c8e
:END:

Remove unnecessary visual elements not only enhances the aesthetics but also
improves startup speed.

#+begin_src emacs-lisp 
(menu-bar-mode   -1) ; Menu bar at top of framen
(scroll-bar-mode -1) ; Visible scroll-bar that appears when scrolling
(scroll-all-mode -1) ; Visible scroll-bar during synchronized scrolling
(tool-bar-mode   -1) ; Icons like "save" button below menu
(tooltip-mode    -1) ; Hoving over (some) elements triggers pop-up boxes
#+end_src

#+begin_src emacs-lisp 
(setq-default initial-major-mode 'text-mode
              inhibit-startup-echo-area-message t ; Disable initial echo message
              inhibit-startup-message t    ; Disable startup message
              inhibit-startup-screen t     ; Disable start-up screen
              inhibit-splash-screen t      ; Disable startup screens/messages
              initial-scratch-message nil  ; Empty '*scratch*' buffer
              initial-buffer-choice t)     ; Open '*scratch*' buffer
#+end_src

** Disable (Some) Warnings

=warning-suppress-types= setting controls the messages sent to =*Warnings*=
buffer. Here, we ignore warnings about "existing variables being aliased",
which are triggered when Emacs packages do not come with =lexical-bindings=.

*Source:*
+ [[https://github.com/Thaodan/emacs.d][github.com/Thaodan]]
+ [[https://github.com/MArpogaus/emacs.d?tab=readme-ov-file#optimize-startup-time][github.com/MArpogaus]]

#+begin_src emacs-lisp 
(setopt warning-suppress-types '((defvaralias) (lexical-binding)))
#+end_src

*N.B.* Including ~;; -*- lexical-binding: t; -*-~ at the top of Emacs lisp files is
essential for controlling how variable bindings work in the code.

** Doom Runtime Optimizations

=Doom Emacs= contains a number of setting configurations to improve runtime
performance. The following was copied from [[https://github.com/doomemacs/doomemacs/blob/da3d0687c5008edbbe5575ac1077798553549a6a/lisp/doom-start.el#L30][doom-start.el]].

*Source:*
+ [[https://github.com/doomemacs/doomemacs/blob/da3d0687c5008edbbe5575ac1077798553549a6a/lisp/doom-start.el#L30][github.com/doomemacs]]
+ [[https://github.com/MArpogaus/emacs.d?tab=readme-ov-file#doom-runtime-optimizations][github.com/MArpogaus]]

#+begin_src emacs-lisp
;; PERF: A second, case-insensitive pass over `auto-mode-alist' is time wasted.
(setq auto-mode-case-fold nil)

;; PERF: Disable bidirectional text scanning for a modest performance boost.
;;   I've set this to `nil' in the past, but the `bidi-display-reordering's
;;   docs say that is an undefined state and suggest this to be just as good:
(setq-default bidi-display-reordering 'left-to-right
              bidi-paragraph-direction 'left-to-right)

;; PERF: Disabling BPA makes redisplay faster, but might produce incorrect
;;   reordering of bidirectional text with embedded parentheses (and other
;;   bracket characters whose 'paired-bracket' Unicode property is non-nil).
(setq bidi-inhibit-bpa t)  ; Emacs 27+ only

;; Reduce rendering/line scan work for Emacs by not rendering cursors or
;; regions in non-focused windows.
(setq-default cursor-in-non-selected-windows nil)
(setq highlight-nonselected-windows nil)

;; More performant rapid scrolling over unfontified regions. May cause brief
;; spells of inaccurate syntax highlighting right after scrolling, which should
;; quickly self-correct.
(setq fast-but-imprecise-scrolling t)

;; Increase how much is read from processes in a single chunk (default is 4kb).
;; This is further increased elsewhere, where needed (like our LSP module).
(setq read-process-output-max (* 64 1024))  ; 64kb

;; Don't ping things that look like domain names.
(setq ffap-machine-p-known 'reject)

;; Emacs "updates" its ui more often than it needs to, so slow it down slightly
(setq idle-update-delay 1.0)  ; default is 0.5

;; Font compacting can be terribly expensive, especially for rendering icon
;; fonts on Windows. Whether disabling it has a notable affect on Linux and Mac
;; hasn't been determined, but do it anyway, just in case. This increases
;; memory usage, however!
(setq inhibit-compacting-font-caches t)

;; Introduced in Emacs HEAD (b2f8c9f), this inhibits fontification while
;; receiving input, which should help a little with scrolling performance.
(setq redisplay-skip-fontification-on-input t)
#+end_src

* Init File
:PROPERTIES:
:header-args: :tangle init.el
:END:

The =init.el= serves as the primary configuration file. Most settings and
configurations are organized in separate 'modules/init-*.el' files and loaded
at the end of this file.

#+begin_src emacs-lisp :noweb yes :comments no
<<header(FILENAME="init.el")>>
#+end_src

