README.org
** Profile Emacs Startup
:PROPERTIES:
:ID:       1269b427-94e9-4df5-98bf-c83a31db096d
:END:

This custom code computes general startup statistics and returns them in
=*scratch*=. This is possible based on our configuration of =initial-buffer-choice=
and =initial-scratch-message= settings in the [[id:534b1a9a-e956-42b1-bf81-40b4e82b2c8e][Disable UI Elements]] section.

*N.B.* If ~use-pacakge-compute statistics t~ (set in [[id:a4fb8525-6004-4685-b4cc-297699db426e][Setup Use-Package]]), calling
~M-x use-package-report~ opens temporary buffer containing package-specific
initialization times.

#+begin_src emacs-lisp 
;; https://github.com/LionyxML/emacs-kick/blob/master/init.el
(add-hook 'after-init-hook
          (lambda ()
            (with-current-buffer (get-buffer-create "*scratch*")
              (insert (format "*Welcome to Emacs!*

+ Loading time :: %s secs
+ Packages :: %s
+ Garbage Collections :: %s"
                              (emacs-init-time "%.2f")
                              (number-to-string (length package-activated-list))
                              gcs-done)))))
#+end_src

** Package Setup
*** Initialize Package Resources

Here, we setup package management, specify desired package archives, and
prioritize them for efficient package installation/updates.

#+begin_src emacs-lisp 
;; Required for managing external packages
(require 'package)

(setopt package-archives
      '(("gnu elpa"  . "https://elpa.gnu.org/packages/")
        ("melpa"     . "https://melpa.org/packages/")
        ("nongnu"    . "https://elpa.nongnu.org/nongnu/"))
      package-archive-priorities
      '(("melpa"    . 6)
        ("gnu elpa" . 5)
        ("nongnu"   . 4)))

;; MANDITORY: Emacs must be aware of available packages before installing
(package-initialize)
#+end_src

*** Setup Use-Package
:PROPERTIES:
:ID:       a4fb8525-6004-4685-b4cc-297699db426e
:END:

~use-package~ is an Emacs macro (added in Emacs29) designed to simplify and
optimize the configuration and management of Emacs packages.

+ use-package-ensure :: External package provides =use-package-always-ensure=
  setting, describe below.

+ use-package-always-ensure :: Automatically installs any package specified in
  a =use-package= declaration if not already installed. No longer need to add
  ~:ensure t~ each time, making the configuration cleaner and less error-prone.

+ use-package-compute-statistics :: ~t~ in order to track package load
  times. Setting necessary for [[id:1269b427-94e9-4df5-98bf-c83a31db096d][Profile Emacs Startup]]

+ use-package-verbose :: ~t~ to return output messages during the loading and
  installation of packages. This is helpful for debugging and tracking the
  loading process.

#+begin_src emacs-lisp 
;; Ensures backwards compatability ('use-package' added in Emacs29)
(unless (package-installed-p 'use-package)
  (package-install 'use-package))

(require 'use-package-ensure)
(setopt use-package-always-ensure t
        use-package-compute-statistics t
        use-package-verbose t)
#+end_src

** Tidy Emacs Directory
:PROPERTIES:
:ID:       a0a6ce0f-55d9-415f-a70c-48716e9d8c61
:END:

=no-littering= is an Emacs package designed to organize =.emacs.d= and prevent
clutter from various configuration files and cached data. By default,
configuration and data files in =/etc= and =/var= sub-directories, respectively, of
~user-emacs-directory~. This is advantageous as default paths used to store these
items may not be consistent across Emacs packages.

*N.B.* Emacs stores customization information in =custom.el=. Here, we move that
file to =/etc= and load.

*N.B.* It does not make sense to version control configuration and data files;
they are updated too frequently. However, it is annoying to lose customizations
like bookmarks should we re-clone this repo. Alternatively, it is possible to
store these files in a directory that is backed up to the "cloud" like
=keybase=. This was achieved by creating a simulink to
=/run/user/1001/keybase/...=; we assign that directory to ~my-persist-dir~ which is
referenced in the [[id:7fed44cb-7196-48f4-9708-b6012d1c6c5d][Denote]] and [[id:e62f2c9a-f7fa-4972-afc6-b0dd072d6474][Org-Agenda]] sub-sections.

#+begin_src emacs-lisp 
;; Directory to be backed up in the cloud
(defconst my-persist-dir "/home/jon/.kb_persistent_emacs/")

(use-package no-littering
  :demand t
  :init
  (setopt no-littering-etc-directory (concat my-persist-dir "no-littering/"))
  (setopt no-littering-var-directory (concat my-persist-dir "no-littering/"))
  :config
  (setopt custom-file (no-littering-expand-etc-file-name "custom.el"))
  (load custom-file :no-error-if-file-is-missing))
#+end_src

* Emacs
:PROPERTIES:
:header-args: :tangle modules/init-emacs.el
:END:

#+begin_src emacs-lisp :noweb yes :comments no
<<header(FILENAME="init-emacs.el")>>
#+end_src

** Frame
*** Frame Size

=default-frame-alist= setting specifies parameters of an Emacs frame. Adding
~'(fullscreen . maximized)~ configures Emacs to automatically open in
full-screen.

#+begin_src emacs-lisp 
(add-to-list 'default-frame-alist '(fullscreen . maximized))
#+end_src

*** Frame Title

=frame-title-format= setting specifies the template for displaying the title bar
of visible Emacs frames. Here, we set it to read ~emacs: <file-name>~.

#+begin_src emacs-lisp 
(setopt frame-title-format
        '("emacs: "
          (:eval (if (buffer-file-name)
                     (abbreviate-file-name (buffer-file-name)) "%b"))))
#+end_src

*** Buffer Name

=uniquify-buffer-name-style= setting controls how Emacs handles the naming of
buffers displaying files containing the same name; for example
=~/dir/subdir_1/file.el= and and =~/dir/subdir_2/file.el=.

Setting to ~'forward~ displays the name as a truncated file-path in order to
distinguish between files; resulting in =subdir_1/file.el= and =subdir_2/file.el=.

#+begin_src emacs-lisp 
(setopt uniquify-buffer-name-style 'forward)
#+end_src

** Minibuffer

The following recommendations are suggested by the creator of the =vertico.el=
package (see [[https://github.com/minad/vertico][github/vertico]])

*** Recursive Minibuffer
:PROPERTIES:
:ID:       dfe5aad6-6c0b-4e06-8c83-028a59bb9ad1
:END:

=enable-recursive-minibuffers=, when set to ~t~ allows us to enter multiple
minibuffer commands consecutively without closing the previous one. This is
useful when accessing information while already in a minibuffer prompt.

*Example Use-Case:* Checking another file's path in the middle of a ~M-x find-file~
prompt. Possible to call ~M-x~ again, open another minibuffer, check what we
need, and then return to the initial minibuffer.

#+begin_src emacs-lisp 
(setopt enable-recursive-minibuffers t)
#+end_src

*** Read-only Minibuffer
:PROPERTIES:
:ID:       bbc9b953-b553-4928-a0ef-daf6df48a1f8
:END:

The minibuffer-prompt is not meant to be edited. Setting
=minibuffer-prompt-properties= to read-only and hooking the built-in
=cursor-intangible-mode= prevents accidental modifications of the prompt text.

#+begin_src emacs-lisp 
(setopt minibuffer-prompt-properties
        '(read-only t cursor-intangible t face minibuffer-prompt))

(add-hook 'minibuffer-setup-hook #'cursor-intangible-mode)
#+end_src

*N.B.* If ~(setopt minibuffer-prompt-properties nil)~ and we call ~M-x~, possible to
modify the "M-x" by moving the cursor back and deleting "M", "-", and/or
"x". _Not ideal_.

*** Make C-g a Bit More Helpful
:PROPERTIES:
:ID:       51c833dd-b403-40e5-8359-f3b6f15193ff
:END:

By default, the function =keyboard-quit= only closes the minibuffer if the cursor
is inside the minibuffer-window. That is annoying. The following adds some
quality-of-life refinement.

*Source:* [[https://protesilaos.com/codelog/2024-11-28-basic-emacs-configuration/#h:1e468b2a-9bee-4571-8454-e3f5462d9321][protesilaos.com/basic-emacs-configuration]]

#+begin_src emacs-lisp 
(defun prot/keyboard-quit-dwim ()
  "Do-What-I-Mean behaviour for a general `keyboard-quit'.

The generic `keyboard-quit' does not do the expected thing when
the minibuffer is open.  Whereas we want it to close the
minibuffer, even without explicitly focusing it.

The DWIM behaviour of this command is as follows:

- When the region is active, disable it.  When a minibuffer is
- open, but not focused, close the minibuffer.  When the
- Completions buffer is selected, close it.  In every other case
- use the regular `keyboard-quit'."
  
  (interactive)
  (cond
   ((region-active-p)
    (keyboard-quit))
   ((derived-mode-p 'completion-list-mode)
    (delete-completion-window))
   ((> (minibuffer-depth) 0)
    (abort-recursive-edit))
   (t
    (keyboard-quit))))

(define-key global-map (kbd "C-g") #'prot/keyboard-quit-dwim)
#+end_src

*** Custom Minibuffer Functions
**** Jump to Minibuffer

This is just nice to have.

#+begin_src emacs-lisp 
(defun my/jump-to-minibuffer ()
  "Switch to minibuffer window (if active)"
  (interactive)
  (when (active-minibuffer-window)
    (select-window (active-minibuffer-window))))
#+end_src

** Cursor
*** Cursor Style

#+begin_src emacs-lisp 
(setq-default cursor-type 'bar)
#+end_src

** Mouse/Scrolling
*** Precision Scrolling

=pixel-scroll-precision-mode= is a /built-in/ minor-mode that, when activated,
provides a smoother, more precise scrolling experience. Scrolling occurs by
pixel and not by larger fixed amounts like whole lines or pages.

*N.B.* Recommended by [[https://tony-zorman.com/posts/emacs-potpourri.html][tony-zorman.com]]

#+begin_src emacs-lisp 
(pixel-scroll-precision-mode 1)
#+end_src

*** Mouse Behavior

+ mouse-yank-at-point :: ~t~ to paste at cursor, not where mouse is pointing
+ mouse-wheel-follow-mouse :: ~'t~ to scroll buffer under mouse
+ mouse-wheel-progressive-speed :: ~nil~ to disable accelerated scrolling

#+begin_src emacs-lisp 
(setopt mouse-yank-at-point t
        mouse-wheel-follow-mouth 't
        mouse-wheel-progressive-speed nil)
#+end_src

** Line Numbers
*** Display Line Numbers in Fringe
:PROPERTIES:
:ID:       253507fc-cbf8-40a5-a490-c8651a7d44dd
:END:

=display-line-numbers= is an Emacs package providing =display-line-numbers-mode=
that, when activated, displays the line number on the left side of the buffer.

By default, the fringe is not a fix amount so code on line ~1_000~ will appear
slightly indented from code on line ~1~. To prevent this,
=display-line-numbers-width= is set to ~4~ as we do not anticipate working on files
longer than ~9_999~ lines.

*N.B.* See =global-display-line-numbers-mode=

#+begin_src emacs-lisp 
(use-package display-line-numbers
  :after org-mode
  :hook ((prog-mode conf-mode text-mode)
         (org-mode . (lambda () (display-line-numbers-mode 0))))
  :custom
  (display-line-numbers-width  4 "Prevent uneven gutter due to length of linum"))
#+end_src

** Buffers
*** Buffer Column Width
:PROPERTIES:
:ID:       6881fadb-9439-4939-974c-e50265bd8a0a
:END:
:RELATED:
+ [[id:c955493b-ad4d-4661-ba0a-ad79ce52dbc4][Cleanup White Spaces]] :: See =whitespace-line-column=
:END:

=fill-column= setting specifies the maximum width (ie number of columns) of the
buffer before text is wrapped, or filled, to the next line. Setting to ~79~ to
comply with =PEP8= style guide.

#+begin_src emacs-lisp 
(setopt fill-column 79)
#+end_src

*** Visual Line Wrapping

=global-visual-line-mode= is a /built-in/ minor-mode that, when activated, enables
visual line wrapping across all buffers. Lines that exceed the width of the
frame are automatically wrapped.

#+begin_src emacs-lisp 
(global-visual-line-mode 1)

;; Break at whitespace, not middle of word
(setopt word-wrap t)
#+end_src

*** Overwrite Active Region

=delete-selection-mode= is a /built-in/ minor-mode that, when activated, replaces
or overwrites the selected region. This behavior is similar to most text
editors. Deactivated by default, Emacs will paste/enter text _after_ the selected
region. *Annoying*.

#+begin_src emacs-lisp 
;; Replace active region when typing text
(delete-selection-mode 1)
#+end_src

*** Automatic Buffer Reloading

=global-auto-revert-mode= is a /built-in/ minor-mode that, when
activated,automatically reloads buffers when the underlying file changes on
disk. This is particularly useful when open files change should we switch =git=
branches.

#+begin_src emacs-lisp 
(global-auto-revert-mode 1)
#+end_src

*** Custom Buffer Functions
:PROPERTIES:
:ID:       453fdeac-b2bb-4217-9803-d5c89ceaf6de
:END:
:RELATED:
+ [[id:d831e4e4-e9b1-480e-aa1a-a152d9707275][General.el]]
:END:

**** Copy Buffer Name

#+begin_src emacs-lisp 
(defun my/kill-buffer-name ()
  "Copy file-name of current buffer"
  (interactive)
  (kill-new (buffer-name)))
#+end_src

**** Copy Relative Buffer Path

#+begin_src emacs-lisp 
(defun my/kill-relative-buffer-path ()
  "Copy relative buffer path to kill ring.

Replace '/home/<username>' prefix with '~' if applicable."
  (interactive)
  (if-let* ((full-path (buffer-file-name))
            (abbrev-path (abbreviate-file-name full-path)))
      (progn
        (kill-new abbrev-path)
        (message "Buffer path copied to kill ring: %s" full-path))
    (message "Buffer is not visiting a file.")))
#+end_src

**** Kill Buffers Except Scratch

*N.B.* ~M-x crux-kill-other-buffers~ to kill all but current buffer

#+begin_src emacs-lisp 
(defun my/kill-buffers-except (buffer-name)
  "Kill all buffers except for BUFFER-NAME."
  (dolist (buffer (buffer-list))
    (unless (or (string-equal (buffer-name buffer) buffer-name)
                (string-equal (buffer-name buffer) (concat " " buffer-name)))
      (kill-buffer buffer))))
#+end_src

#+begin_src emacs-lisp 
(defun my/kill-all-buffers-except-scratch ()
  "Kill all buffers except for *scratch*."
  (interactive)
  (my/kill-buffers-except "*scratch*"))
#+end_src

**** Kill Buffers Given Mode

#+begin_src emacs-lisp 
(defun my/kill-buffers-by-mode (&rest modes)
  "Kill all buffers derived from any of MODES.

Ex: (my/kill-buffers-by-mode 'help-mode 'helpful-mode)"
  (let ((killed 0))
    (mapc (lambda (buffer)
            (with-current-buffer buffer
              (when (apply #'derived-mode-p modes)
                (kill-buffer buffer)
                (setq killed (1+ killed)))))
          (buffer-list))
    (message "Killed %d buffer(s) derived from %s" killed modes)))
#+end_src

** White Space
