README.org
*** Indicate Empty Lines

=indicate-empty-lines= setting, when set to ~t~, highlights empty lines in the
buffer. Later, we will configure the automatic removal of empty lines.

#+begin_src emacs-lisp 
(setopt indicate-empty-lines t)
#+end_src

*** Cleanup White Spaces
:PROPERTIES:
:ID:       c955493b-ad4d-4661-ba0a-ad79ce52dbc4
:END:

=whitespace= is a /built-int/ Emacs package providing =whitespace-mode= that, when
activated, highlights white-spaces in buffers; the package also includes
=whitespace-cleanup-mode= which automatically removes white-spaces.

*N.B.* [[https://www.emacswiki.org/emacs/WhiteSpace][Emacswiki]] provides a nice overview of the settings.

=whitespace-style= setting specifies /which/ white-spaces are visualized:
  + face :: Visualize spaces by changing =face= color (instead of in table)
  + trailing :: Flag trailing white-space
  + lines-tail :: Columns beyond ~whitespace-line-column~ are
    highlighted via faces (must exclude =lines= in our configuration).
  + empty :: Flag empty lines (only at beginning/end of buffer)
  + indentation::space :: Flag ~TABs~ at beginning of lines
  + space-before-tab::tab :: Flag extra ~SPC~ before ~TAB~

*N.B.* =fill-column= previously set in [[id:6881fadb-9439-4939-974c-e50265bd8a0a][Buffer Column Width]] section.

#+begin_src emacs-lisp 
(use-package whitespace
  :hook ((prog-mode . whitespace-mode)
         (before-save . whitespace-cleanup)
         ;; Disable in 'org'; always flags long org-links
         (org-mode . (lambda () (whitespace-mode 0)))
         ;; Makefiles rely heavily on indentation and whitespace
         (makefile-mode . (lambda ()
                            (setq indent-tabs-mode t
                                  whitespace-mode nil)
                            (add-hook 'before-save-hook
                                      #'delete-trailing-whitespace))))
  :custom
  (whitespace-line-column fill-column "Highlight text beyond column")
  (whitespace-style '(face
                      trailing
                      lines-tail
                      empty
                      indentation::space
                      space-before-tab::tab))
  :config
  (global-whitespace-mode 0))
#+end_src

** Indentation
*** Indentation Width

=tab-width= setting specifies the number of spaces a single ~TAB~
represents. Alternatively, =standard-indent= setting sets the number of spaces
for Emacs commands that do not have a specific indentation width set. For
consistency, we define and set both variables to =my-indent-width=.

#+begin_src emacs-lisp 
(setq my-indent-width 4)
(setq-default tab-width my-indent-width
              standard-indent my-indent-width)
#+end_src

*** Tab Behavior
:PROPERTIES:
:ID:       925b16ea-4f78-49ca-93db-0012b84ca33f
:END:

=tab-always-indent= setting specifies the behavior of ~TAB~. This is particularly
relevant in programming modes. Setting to ~'complete~ results in ~TAB~ first
attempting to indent the line (if the line is already properly indented);
otherwise ~TAB~ will trigger code completion instead (if available).

#+begin_src emacs-lisp 
(setq-default tab-always-indent 'complete)
#+end_src

*** Indent Using Spaces

=indent-tabs-mode= is a /built-in/ minor-mode that, when activated, specifies that
indentation _can_ insert ~\t~ characters. Setting to ~nil~ deactivate the mode, thus
~\s~ is used; as recommended in the =PEP8= style guide, removing discrepancies that
may occur between different text editors or IDEs.

#+begin_src emacs-lisp 
(setq-default indent-tabs-mode nil)
#+end_src

** History
*** Window Layout History

=winner-mode= is a /built-in/ minor-mode that, when activated, tracks changes to
window layouts (ie splits, closing, resizing, etc). Changes are stored in
=winner-ring-alist=. The mode includes two functions for undoing and redoing
changes to the window:

+ winner-undo :: Default ~C-c <left>~ to revert window layout
+ winner-redo :: Default ~C-c <right>~ to redo the previously undone change

#+begin_src emacs-lisp 
(winner-mode 1)
#+end_src

*** Minibuffer History
:PROPERTIES:
:ID:       e010f1a6-c723-4ca1-bf39-62b3a9672797
:END:

=savehist-mode= is a /built-in/ minor-mode that, when activated, saves the
minibuffer history (ie commands, file-names, search history, etc) across Emacs
sessions. Minibuffer history saved in =savehist.el= (see =savehist-file= variable),
whose location is modified by the =no-litter= package (see [[id:a0a6ce0f-55d9-415f-a70c-48716e9d8c61][Tidy Emacs Directory]]).

*N.B.* Recommended by the creator of the =vertico.el= ([[https://github.com/minad/vertico][github/vertico]]).

#+begin_src emacs-lisp 
(savehist-mode 1)
#+end_src

*** Cursor Position History

=saveplace-mode= is a /built-in/ minor-mode that, when activated, saves the cursor
position in a given file; if previously visited, the cursor will move to the
last known position. Cursor positions saved in =save-place.el= (see
=save-place-file= variable), whose location is modified by the =no-litter= package
(see [[id:a0a6ce0f-55d9-415f-a70c-48716e9d8c61][Tidy Emacs Directory]]).

*N.B.* Suggested in [[https://www.jamescherti.com/essential-emacs-packages/][jamescherti.com]] blog-post.

#+begin_src emacs-lisp 
(save-place-mode 1)
#+end_src

** Prompting
*** Lazy Prompt Response

=use-short-answers= setting, when set to ~t~, allows users to respond to
confirmation prompts with simple ~y~ or ~n~ (instead of typing the full words).

The functions =yes-or-no-p= and =y-or-n-p= are effectively the same, however the
former requires full ~yes~ or ~no~ answers. Here, we effectively replace the
function with =y-or-no-p= so that single letter answers may be used across all
prompts.

*N.B.* Suggested in [[https://www.masteringemacs.org/article/disabling-prompts-emacs][masteringemacs.org]] article.

#+begin_src emacs-lisp 
(setopt use-short-answers t)
(fset 'yes-or-no-p 'y-or-n-p)
#+end_src

*** Disable New File Confirmation

=confirm-nonexistent-file-or-buffer= setting, when set to ~nil~, disables user
confirmation before visiting a new file or buffer.

*N.B.* Suggested in [[https://www.masteringemacs.org/article/disabling-prompts-emacs][masteringemacs.org]] article.

#+begin_src emacs-lisp 
(setopt confirm-nonexistent-file-or-buffer nil)
#+end_src

*** CRM Prompt Indicator

The custom function ~crm-indicator~ adds an indicator to the completion prompt
when using ~completing-read-multiple~. This makes it easier to visualize multiple
inputs.

*N.B.* Suggested by the creator of the =vertico.el= package ([[https://github.com/minad/vertico][github/vertico]]).

#+begin_src emacs-lisp 
(defun my/crm-indicator (args)
  "Add indicator to completion promp when using 'completing-read-multiple'"
  (cons (format "[CRM%s] %s"
                (replace-regexp-in-string
                 "\\`\\[.*?]\\*\\|\\[.*?]\\*\\'" ""
                 crm-separator)
                (car args))
        (cdr args)))

(advice-add #'completing-read-multiple :filter-args #'my/crm-indicator)
#+end_src

For example, calling the example function ~test-crm-indicator~ indicates that
selecting multiple options is both possible using a comma-separator.

*N.B.* src-block not tangled to configuration file.

#+begin_src emacs-lisp :tangle no
(defun test-crm-indicator ()
  "A custom function using completing-read-multiple."
  (interactive)
  (let ((choices '("Option A" "Option B" "Option C")))
    (completing-read-multiple "Choose options: " choices)))
#+end_src

*** Killing Buffer with Live Process

The following sidesteps the prompt that asks you if you want to kill a buffer
with a live process attached to it.

*N.B.* Suggested in [[https://www.masteringemacs.org/article/disabling-prompts-emacs][masteringemacs.org]] article.

#+begin_src emacs-lisp 
(setopt kill-buffer-query-functions
        (remq 'process-kill-buffer-query-function
              kill-buffer-query-functions))
#+end_src

** Highlighting
:PROPERTIES:
:ID:       1ae14e20-459c-44ec-8c2a-b5f2f64116ac
:END:
:RELATED:
+ [[id:5e72d5f0-fdaf-491a-9a84-9806ee295d0a][Highlight TODOs]]
:END:

*** Cursor When Switching Buffers

=beacon= is an Emacs package providing =beacon-mode= minor-mode that, when
activated, highlights (flashes) the line containing the cursor when changing
current buffers.

#+begin_src emacs-lisp 
(use-package beacon
  :hook (after-init . beacon-mode))
#+end_src

*** Matching Delimiter Pairs

=paren= is a /built-in/ Emacs package providing =show-paren-mode= that, when
activated, highlights matching pairs of parentheses/delimiters when the cursor
is positioned at a delimiter. Several settings should be mentioned:

+ show-paren-style :: ~'parenthesis~ to only highlight delimiter
  - ~'expression~ highlights the entire enclosed text
+ show-paren-context-when-offscreen :: ~'overlay~
  - Overlay popup provides additional context if matching pair off screen

*N.B.* The /built-in/ minor-mode =electric-pair-mode= is also activated, which
automatically inserts a closing delimiter.

#+begin_src emacs-lisp 
(use-package paren
  :custom
  (show-paren-style 'parenthesis "Only highlight ()")
  (show-paren-when-point-inside-paren t)
  (show-paren-when-point-in-periphery t)
  ;; If cursor on ), show overlay for (
  (show-paren-context-when-offscreen 'overlay)
  :config
  (show-paren-mode 1)
  (electric-pair-mode 1))
#+end_src

*** Symbols/Things at Point

=highlight-thing= is an Emacs package providing =highlight-thing-mode= that, when
activated, automatically highlights all visible occurrences of the symbol/thing
at point.

#+begin_src emacs-lisp 
(use-package highlight-thing
  :demand t
  :hook ((prog-mode . highlight-thing-mode)
         (org-mode . highlight-thing-mode))
  :custom
  (highlight-thing-exclude-thing-under-point t)
  (highlight-thing-case-sensitive-p t)
  (highlight-thing-ignore-list
   '("False" "True", "return", "None", "if", "else", "self",
     "import", "from", "in", "def", "class")))
#+end_src

*** Line at Point

=global-hl-line-mode= is a /built-in/ minor-mode that, when activated, highlights
the current line (see related =hl-line-mode=).

#+begin_src emacs-lisp 
(global-hl-line-mode 1)
#+end_src

*** Pulse Killed Region

The custom function, copied from [[https://www.youtube.com/watch?v=oQ9JE9kRwG8][youtube/gopar]], highlights (pulses) the current
region and is executed before =kill-ring-save=, making it easier to visualize
what text/region is being copied.

#+begin_src emacs-lisp 
(defun gopar/pulse-current-region (&rest _)
  "Pulse the current implicit or active region"
  (if mark-active
      (pulse-momentary-highlight-region (region-beginning) (region-end))
    (pulse-momentary-highlight-region (mark) (point))))

(advice-add #'kill-ring-save :before #'gopar/pulse-current-region)
#+end_src

** Files + Encoding
*** Automatically Revert Buffer

=global-auto-revert-mode= is a /built-in/ minor-mode that, when activated,
automatically refreshes the contents of buffers after the visited file changes
on disk. This ensures buffers are automatically updated after changing =git=
branches.

#+begin_src emacs-lisp 
(global-auto-revert-mode)
#+end_src

*** Encoding

[[https://blog.hubspot.com/website/what-is-utf-8][UTF-8]] is central to the storage and encoding of text and files. Although other
encoding systems exist, =utf-8= is practically a standard, at least in the West,
and so it is important that we instruct Emacs to treat files as UTF-8 by
default. For more information, read [[https://www.masteringemacs.org/article/working-coding-systems-unicode-emacs][MasteringEmacs]].

#+begin_src emacs-lisp 
;; https://www.masteringemacs.org/article/working-coding-systems-unicode-emacs
(set-default-coding-systems 'utf-8)

;; https://github.com/Thaodan/emacs.d
(define-coding-system-alias 'UTF-8 'utf-8)
#+end_src

** Boookmarks

=bookmark= is a /built-in/ Emacs package providing users the ability to efficiently
store and access specific locations in frequently visited files. Bookmarks are
saved in =bookmarks-default.el= (see =bookmark-file= variable), whose location is
modified by the =no-litter= package (see [[id:a0a6ce0f-55d9-415f-a70c-48716e9d8c61][Tidy Emacs Directory]]).

Frequently used functions include:

+ bookmark-set :: ~C-x r m~; Set bookmark at current location
  - Prompt user for desired name of bookmark
  - Bookmarked locations indicated by flag in fringe of buffer
  - Bookmark details stored in =bookmark-alist=

+ bookmark-jump :: ~C-x r b~; Select bookmark and jump to location

+ bookmark-save :: Export =bookmark-alist= to specified file

+ bookmark-delete :: Delete bookmark in =bookmark-alist=

+ bookmark-bmenu-list :: Open buffer containing all bookmarks

*N.B.* Related, the =register= package is a temporary alternative where locations
are assigned to a single character (and do not persist in memory). Something to
explore in the future.

#+begin_src emacs-lisp 
(use-package bookmark
  :custom
  (bookmark-save-flag t "Save bookmarks when Emacs killed")
  (bookmark-fringe-mark t "Non-nil to show icon in fringe"))
#+end_src

** Images
:PROPERTIES:
:ID:       0bdd31cb-56e6-4709-8294-a6c701dad660
:END:
:RELATED:
+ [[id:c934464b-8b3c-4203-ac56-d916e21d470c][Images in Org]]
:END:

*** Automatically Display Image Files

=auto-image-file-mode= is a /built-in/ minor-mode that, when activated,
automatically displays image files when opened.

#+begin_src emacs-lisp 
(auto-image-file-mode 1)
#+end_src

** Ediff

=ediff-split-window-function= setting controls how Emacs splits the window when
displaying two files or buffers in =ediff=. Setting to ~'split-window-horizontally~
ensures that the buffers are side by side from each other.

=ediff-window-setup-function= setting controls how =ediff= mananges the window
layout in Emacs. Setting to ~'ediff-setup-windows-plain~ ensures that both =ediff=
windows are open in the current Emacs frame.

#+begin_src emacs-lisp 
(setopt ediff-split-window-function 'split-window-horizontally
        ediff-window-setup-function 'ediff-setup-windows-plain)
#+end_src

** Custom Functions
:PROPERTIES:
:ID:       8f4885df-ad58-432b-a6cd-1f4524bfc868
:END:
:RELATED:
+ [[id:d831e4e4-e9b1-480e-aa1a-a152d9707275][General.el]]
:END:

*** Jump to Configuration README.org

See ~M-x crux-find-user-init-file~ to open =init.el=.

#+begin_src emacs-lisp 
(defun my/find-config-file ()
  "Open 'README.org' in other window."
  (interactive)
  (find-file-other-window (concat user-emacs-directory "README.org")))
#+end_src

*** Evaluate init.el

#+begin_src emacs-lisp 
(defun my/eval-init ()
  "To quickly reload the 'init.el' file."
  (interactive)
  (load-file user-init-file))
#+end_src

** Provide init-emacs.el

#+begin_src emacs-lisp
(provide 'init-emacs)
;;; init-emacs.el ends here
#+end_src

* UI
:PROPERTIES:
:header-args: :tangle modules/init-ui.el
:END:

#+begin_src emacs-lisp :noweb yes :comments no
<<header(FILENAME="init-ui.el")>>
#+end_src

** Themes
*** Load Theme Advice

Emacs themes specify the colors of various ~custom-set-faces~. When switching
between themes, some parts of the old theme remain if the new theme does not
specify the same faces. It is possible to avoid this issue by disabling the
current theme before switching.

#+begin_src emacs-lisp 
;; https://www.unwoundstack.com/blog/switching-emacs-themes.html
(define-advice load-theme (:before (&rest _args) theme-dont-propagate)
  (mapc #'disable-theme custom-enabled-themes))
#+end_src

