modules/init-ui.el

;; https://www.unwoundstack.com/blog/switching-emacs-themes.html
(define-advice load-theme (:before (&rest _args) theme-dont-propagate)
  (mapc #'disable-theme custom-enabled-themes))
