README.org
*** Doom Themes
:PROPERTIES:
:ID:       671dbaef-69f8-4ea6-870f-a72ebf5e13d7
:END:

=doom-themes= is an Emacs package containing a number of Emacs themes.

#+begin_src emacs-lisp 
;; Effectively copied from https://github.com/doomemacs/themes
(use-package doom-themes
  :ensure t
  :config
  (setopt doom-themes-enable-bold t
          doom-themes-enable-italic t)
  (doom-themes-visual-bell-config)
  (doom-themes-org-config))
#+end_src

*** Custom Theme Functions

These functions make it easier to switch between light- and dark-themes.

#+begin_src emacs-lisp 
(defun light ()
  (interactive)
  (load-theme 'doom-tomorrow-day t))

(defun dark ()
  (interactive)
  (load-theme 'doom-one t))
#+end_src

*** Set Default Theme

Below we defined the theme available at startup.

#+begin_src emacs-lisp 
(dark)
#+end_src

** Fonts
:PROPERTIES:
   :ID:       a33827ca-f51c-4ad3-90e3-2b2d894c3d48
   :END:

*** Font Style

In Emacs, fonts can be customized to improve readability and visually organize
different content types such as code, prose, or user interfaces. Three common
font types include:

+ default :: Primary font used if no other specifications are provided
+ fixed-pitch :: Mono-spaced (fixed-width) text typically used in programming
+ variable-pitch :: Proportional fonts often used in =org-mode=

This configuration uses the =Jetbrains Mono= font, which is manually downloaded
from [[https://www.jetbrains.com/lp/mono/][jetbrains.com]]. The font was installed by following the [[https://www.jetbrains.com/lp/mono/#how-to-install][how-to]] instructions
verbatim.

#+begin_src emacs-lisp 
;; https://github.com/daviwil/dotfiles/blob/guix-home/.emacs.d/modules/dw-core.el#L124
(set-face-attribute 'default nil
                    :font "JetBrains Mono"
                    :height 100
                    :weight 'medium)

(set-face-attribute 'fixed-pitch nil
                    :font "JetBrains Mono"
                    :height 100
                    :weight 'medium)

(set-face-attribute 'variable-pitch nil
                    :font "JetBrains Mono"
                    :height 100
                    :weight 'medium)
#+end_src

*** Font Size

In Emacs, the face attribute ~:height~ is a measurement in units of ~0.1~ of a
point. For example, setting the height to ~120~ means a 12-point =font-size=. The
custom function =set-font-size= enables the user to change the font w.r.t. the
more common =font-size=.

#+begin_src emacs-lisp 
;; Modified from https://stackoverflow.com/a/50052751
(defun font-size (fontsize)
  "Set the font-pt size."
  (interactive "nFont size: ")
  (let* ((font-height (* 10 fontsize)))
    (set-face-attribute 'default nil :height font-height)
    (set-face-attribute 'fixed-pitch nil :height font-height)
    (set-face-attribute 'variable-pitch nil :height font-height)))

;; Font size at startup
(font-size 10)
#+end_src

** Icons

=nerd-icons= is an Emacs package that provides icons for use in Emacs
buffers. The use of icons improve readability, for example in the minibuffer
icons are displayed next to the file name indicating whether the file is an
=org=, =python=, or =elisp= file.

#+begin_src emacs-lisp 
(use-package nerd-icons
  :config
  ;; Download nerd-icons if directory not found
  (unless (car (file-expand-wildcards
                (concat user-emacs-directory "elpa/nerd-icons-*")))
    (nerd-icons-install-fonts t)))

;; Icons inside mini-buffer
(use-package nerd-icons-completion
  :after (marginalia nerd-icons)
  :config
  (nerd-icons-completion-mode)
  (add-hook 'marginalia-mode-hook #'nerd-icons-completion-marginalia-setup))

;; Icons inside 'dired' buffers
(use-package nerd-icons-dired
  :after (dired nerd-icons)
  :hook
  (dired-mode . nerd-icons-dired-mode))
#+end_src

** Modeline
*** Mood-line

=doom-modeline= is the most feature-rich mode-line package for Emacs. For some
reason the right end of the mode-line would be cut off so I could not see the
repo name. Instead, defer to =mood-line=, the lightweight alternative to
=doom-modeline=.

#+begin_src emacs-lisp
;; (use-package doom-modeline
;;   :config (doom-modeline-mode 1)
;;   :custom
;;   ;; Display project_name/../file_name
;;   (doom-modeline-buffer-file-name-style 'truncate-with-project)
;;   (doom-modeline-buffer-encoding nil "Dont care about UTF-8 badge")
;;   (doom-modeline-vcs-max-length 30   "Limit branch name length")
;;   (doom-modeline-enable-word-count t "Turn on wordcount"))

(use-package mood-line
  :hook (after-init . mood-line-mode)
  :custom
  (mood-line-glyph-alist mood-line-glyphs-fira-code)
  (mood-line-format
   (mood-line-defformat
    :left
    (((mood-line-segment-modal)                  . " ")
     ((or (mood-line-segment-buffer-status) " ") . " ")
     ((mood-line-segment-project) . "/")
     ((mood-line-segment-buffer-name)            . "\t\t")
     ((mood-line-segment-cursor-position)        . " | ")
     ((mood-line-segment-scroll)                 . "\t\t")
     ((mood-line-segment-anzu)                   . "  "))
    :right
    (((mood-line-segment-major-mode) . "  ")
     ((mood-line-segment-vc)         . "  ")
     ((mood-line-segment-misc-info)  . "  ")
     ((mood-line-segment-checker)    . "  ")
     ((mood-line-segment-process)    . "  ")))))
#+end_src

*** Display Column Numbers

#+begin_src emacs-lisp 
(column-number-mode t)
#+end_src

*** Display Line Numbers

#+begin_src emacs-lisp 
(line-number-mode t)
#+end_src

*** Display Search Matches

=anzu= is an Emacs package providing =anzu-mode= that, when activated, displays the
total number of =isearch= matches (and current match position) in the mode-line.

#+begin_src emacs-lisp 
(use-package anzu
  :hook (emacs-startup . global-anzu-mode)
  :custom
  (anzu-search-threshold 1000 "Limit n words searched to reduce lag")
  (anzu-replace-threshold 50 "Limit n replacement overlay to reduce lag")
  (anzu-minimum-input-length 2 "Increase activation threshold to reduce lag")

  ;; Cleanup mode-line information
  (anzu-mode-lighter "" "Remove mode-name from results")
  (anzu-replace-to-string-separator "")

  :bind (;; Keybindings M-% and C-M-% do not change
         ([remap query-replace] . anzu-query-replace)
         ([remap query-replace-regexp] . anzu-query-replace-regexp)

         :map isearch-mode-map
         ;; Use Anzu-mode for replacing from isearch results (C-s or C-f)
         ([remap isearch-query-replace] . anzu-isearch-query-replace)
         ([remap isearch-query-replace-regexp] . anzu-isearch-query-replace-regexp)))
#+end_src

*** Display Current Function

#+begin_src emacs-lisp
;; Display current function() in mode-line
(use-package which-func
  :commands which-function-mode
  :hook (prog-mode . which-function-mode))
#+end_src

** Spacious Padding

=spacious-padding-mode= increases the space or "padding" around several elements
of the Emacs interface, such as window dividers, the internal frame border, and
padding of the mode-line, and more. The idea is to produce a more comfortable
presentation.

#+begin_src emacs-lisp
(use-package spacious-padding
  :hook (after-init . spacious-padding-mode)
  :custom
  (spacious-padding-widths
   '( :internal-border-width 10 ;; Space between frame & contents
      :right-divider-width 10   ;; Space between side-by-side windows
      :fringe-width 8           ;; Fringe on either side of window
      :header-line-width 4      ;; Space surrpounding 'header-line'
      :mode-line-width 2        ;; Space surrounding 'mode-line'
      :scroll-bar-width nil))   ;; 'scroll-bar' disabled
  (spacious-padding-subtle-mode-line t))
#+end_src

** Provide init-ui.el

#+begin_src emacs-lisp 
(provide 'init-ui)
;;; init-ui.el ends here
#+end_src

* Org-Mode
:PROPERTIES:
:ID:       1360c936-229c-44fd-b71c-30f66960d23a
:header-args: :tangle modules/init-org.el
:END:

#+begin_src emacs-lisp :noweb yes :comments no
<<header(FILENAME="init-org.el")>>
#+end_src

** General Settings

#+begin_src emacs-lisp 
(use-package org
  :demand t
  :bind (("C-c l" . org-store-link)
         ("C-c a" . org-agenda)
         ("C-c c" . org-capture))
  :hook ((org-src-mode . whitespace-cleanup)
         ;; Automatic break line at 'current-fill-column' (line wrapping)
         (org-mode . turn-on-auto-fill))
  :custom
  (org-ellipsis " " "Default to 'org-modern'")
  (org-startup-folded t "Always fold headers")
  (org-startup-indented t "Visually indent at startup")
  (org-adapt-indentation t "Align contents with heading")
  (org-element-use-cache nil "Avoid 'org-element--cache' error")
  (org-id-link-to-org-use-id 'create-if-interactive-and-no-custom-id))
#+end_src

** Org Table of Contents

=org-make-tock= is an Emacs package providing =org-make-toc-mode= that, when
activated, generates a "Table of Contents" (=TOC=) for =org= files. This makes it
easier to navigate large documents. Calling ~org-make-toc-insert~ adds a custom
~:TOC:~ property to the current header. The function ~org-make-toc~ updates the =TOC=
in the current buffer.

#+begin_src emacs-lisp 
(use-package org-make-toc
  :after org
  :hook ((org-mode . org-make-toc-mode)
         (org-mode . (lambda ()
                       ;; 'nil' specifies that this is not a "local" addition
                       ;; 't' ensures the hook is buffer-local
                       (add-hook 'before-save-hook #'org-make-toc nil t)))))
#+end_src

** Org UI
*** Modernize UI in Org-Mode

=org-modern= is an Emacs package providing =org-modern-mode= that, when activated,
adds a more modern and polished look to =org= buffers.

#+begin_src emacs-lisp 
(use-package org-modern
  :after org
  :init (global-org-modern-mode)
  :hook ((org-mode                 . org-modern-mode)
         (org-agenda-finalize-hook . org-modern-agenda))
  :commands (org-modern-mode org-modern-agenda))
#+end_src

*** Hide Emphasis Markers

By default, =Doom Themes= stylizes text surrounded by emphasis markers (see [[id:671dbaef-69f8-4ea6-870f-a72ebf5e13d7][Doom
Themes]]). As such, it is not necessary to display the emphasis markers. The
minor-mode =org-appear-mode= reveals the markers if the cursor moves in between
marker pairs.

#+begin_src emacs-lisp 
(setopt org-hide-emphasis-markers t)

(use-package org-appear
  :after org
  :hook (org-mode . org-appear-mode)
  :custom (org-appear-inside-latex t))
#+end_src

** Org Behavior
*** Speed Commands

=org-use-speed-commands= settings controls whether certain single-key shortcuts
known as /speed commands/ are enabled when the cursor is at the beginning of a
headline. Below, we set the value to a custom lambda function (copied from
[[https://www.reddit.com/r/orgmode/comments/ded3g8/comment/f2x1u1o/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button][reddit]]) that enables the use of speed commands if cursor is on _any_ of the
leading stars.

*N.B.* If ~non-nil~, move cursor to start of any headline and call ~?~ to view list
of available speed commands.

#+begin_src emacs-lisp 
;; ? speed-key opens Speed Keys help.
(setopt org-use-speed-commands
      (lambda ()
        (and (looking-at org-outline-regexp)
             (looking-back "^\**"))))
#+end_src
*** Auto-Tangle

=org-auto-tangle-mode=, when activated, automatically tangles =org=-files on
save. Automatically tangling can be annoying, so we set ~org-auto-tangle-default
nil~. Therefore, automatic tangling only occurs if =#+auto_tangle: t= is added to
the file header.

#+begin_src emacs-lisp
(use-package org-auto-tangle
  :after org
  :hook (org-mode . org-auto-tangle-mode)
  :custom (org-auto-tangle-default nil))
#+end_src

