README.org
*** Archive

These are previous settings that I am not sure whether I want to include in
this configuration.

#+begin_src emacs-lisp :tangle no
;; 'C-a/e' jump to start-end of headline text
(setopt org-special-ctrl-a/e t)

;; 'C-k' behave different on headline text
(setopt org-special-ctrl-k t)

;; Do not delete hidden subtree with 'C-k'
(setopt org-ctrl-k-protect-subtree t)
#+end_src

** Org Babel
*** Languages

=org-babel-load-languages= setting specifies the languages which can be evaluated
in =org= buffers, which must be loaded using the function
~org-babel-do-load-languages~.

#+begin_src emacs-lisp 
(org-babel-do-load-languages 'org-babel-load-languages
                             '((emacs-lisp . t)
                               (shell . t)))
#+end_src

*** Add Org-Block Templates

An =org-block= is a special section of text and possess syntax that distinguish
it from the surrounding content. Though there are many types of =org-blocks=,
they all share the same structure and start/end with ~#+BEGIN_<type>~ and
~#+END_<type>~.

Due to the shared structure, it is possible to define custom blocks via the
=org-structure-template-alist= setting and insert by calling
=org-insert-structure-template= (~C-c C-,~). Here, we define a few block templates
we anticipate using frequently.

#+begin_src emacs-lisp 
(setopt org-structure-template-alist
        '(("x" . "example")
          ("q" . "quote")
          ("e" . "src emacs-lisp")
          ("m" . "src emacs-lisp :tangle modules/init-XXX.el")
          ("s" . "src sh")
          ("p" . "src python")))
#+end_src

*** Turn Off Confirmation

=org-confirm-babel-evaluate= setting, when set to ~t~, prompts the user to confirm
whether they intended to evaluate the code block. *Annoying*.

#+begin_src emacs-lisp 
(setopt org-confirm-babel-evaluate nil)
#+end_src

*** Org-Edit-Special Buffer
**** Preserve Indentation

=org-src-preserve-indentation= setting, when set to ~t~, remove leading whitespace
automatically inserted when exiting the =org-edit-special= buffer.

#+begin_src emacs-lisp 
(setopt org-src-preserve-indentation t)
#+end_src

**** Window Setup

=org-src-window-setup= setting controls how the source code edit buffer is
displayed. Setting to ~'current-window~ ensures that the widow always opens in
the current buffer.

#+begin_src emacs-lisp 
(setopt org-src-window-setup 'current-window)
#+end_src

**** Turn off Exit Prompt

=org-src-ask-before-returning-to-edit-buffer= setting, when ~t~, prompts the user
before returning to an active source code editing buffer. This prevents
conflicting changes should the user switch back to the current buffer and make
changes to the =src-block= of an active =org-edit-special= buffer.

#+begin_src emacs-lisp 
(setopt org-src-ask-before-returning-to-edit-buffer t)
#+end_src

*** FIX: Display ANSI Error Colors

#+begin_src emacs-lisp 
;; https://github.com/emacs-jupyter/jupyter/issues/366
(defun display-ansi-colors ()
  (ansi-color-apply-on-region (point-min) (point-max)))
#+end_src

** Images in Org
:PROPERTIES:
:ID:       c934464b-8b3c-4203-ac56-d916e21d470c
:END:
:RELATED:
+ [[id:0bdd31cb-56e6-4709-8294-a6c701dad660][Images]]
:END:
*** Show Inline Images At Open

=org-startup-with-inline-images= setting, when set to ~t~, displays inline images
when opening an =org= file. If ~nil~, only the links are displayed in the =org=
buffer.

#+begin_src emacs-lisp 
(setopt org-startup-with-inline-images t)
#+end_src

*** Display Inline Remote Images

=org-display-remote-inline-images= setting controls whether images from remote
URLs (like websites) are displayed inline. Setting to ~'cache~ caches inline
images such that re-opening the file does not require re-downloading the
images.

#+begin_src emacs-lisp 
(setopt org-display-remote-inline-images 'cache)
#+end_src

*** Refresh Images After Executing Code

Figures generated in src-blocks are not refreshed automatically. The following
changes ensure that the shown image is the "latest" version of that figure.

#+begin_src emacs-lisp 
(add-hook 'org-babel-after-execute-hook
          (lambda () (org-display-inline-images nil t)))
#+end_src

** Org-Agenda
:PROPERTIES:
:ID:       e62f2c9a-f7fa-4972-afc6-b0dd072d6474
:END:

/How do you organize related TODO items?/

One option is to organize related TODOs under a top-level =org-header= per
project. This would not affect the templates as it is possible to "re-file"
your note by calling ~M-x org-refile~ (~C-c C-w~) instead of ~C-c C-c~. However, this
would affect the =agenda-view= -- the project-level header would be included in
the view, when we really only care about the sub-headers.

Another option is to add a ~:project:~ property in the templates and group
related items using the =org-super-agenda= package. _For now, lets use this
option_. *N.B.* This will require custom functions (see [[id:45a1842a-9f6a-4432-a8cf-ff6c8f217a76][Custom Capture Functions]]).

*** Define Agenda Files
:PROPERTIES:
:ID:       deba8136-212c-4e6a-916c-2f05c180b4f5
:END:

=org-agenda-files= setting defines the files/directories (of files) to be used
for agenda display.

=Org-capture= templates are used to quickly write and save notes in specified
=org-files=. However, the file must be provided as a string and not the output of
some function like ~concat~ (templates are defined in [[id:f5222055-3b85-42fd-8b6f-0f170f75b681][Agenda Capture
Templates]]). Therefore, we create the custom variables ~my-agenda-dir~ and
~my-emacs-agenda~.

#+begin_src emacs-lisp 
(defconst my-agenda-dir (concat my-persist-dir "agendas/"))
(defconst my-emacs-agenda (concat my-agenda-dir "agenda_emacs.org"))

(setopt org-agenda-files (list my-agenda-dir))
#+end_src

*** Agenda Capture Templates
:PROPERTIES:
:ID:       f5222055-3b85-42fd-8b6f-0f170f75b681
:END:

**** Custom Capture Functions
:PROPERTIES:
:ID:       45a1842a-9f6a-4432-a8cf-ff6c8f217a76
:END:

Capture templates can be made generalizable by including function calls within
the string template. It is unlikely that I will be able to remember project
names that exist in the previously defined TODO items. Instead, the following
custom functions collect existing project names in a given file and suggest
them when filling in the template.

#+begin_src emacs-lisp 
(defun org-capture--get-project-entry-from-file (agenda-file-name)
  "Compile list of project names from org-headers in FILE that
contain the :project: property"
  (let (project-names)
    (with-current-buffer (find-file-noselect agenda-file-name)
      (goto-char (point-min))
      (while (re-search-forward "^\\*+ " nil t)
        (when (and (org-entry-get nil "project")
                   (not (org-entry-is-done-p)))
          (add-to-list 'project-names (org-entry-get nil "project")))))
    project-names))

(defun org-capture--select-project-entry (agenda-file-name)
  "Prompt user to select :project: property from FILE"
  (let ((projects (org-capture--get-project-entry-from-file agenda-file-name)))
    (completing-read "Select project:" projects nil nil)))
#+end_src

**** Templates

*N.B.* To avoid repeating the same file-path, agenda files are defined as
variables in [[id:deba8136-212c-4e6a-916c-2f05c180b4f5][Define Agenda Files]].

#+begin_src emacs-lisp 
(setq org-capture-templates
      '(("e" "Emacs Config Task" entry (file my-emacs-agenda)
         "* TODO %^{Task} %^g
:PROPERTIES:
:project: %(org-capture--select-project-entry my-emacs-agenda)
:END:
:LOGBOOK:
- State \"TODO\"       from              %U

  %?
:END:"
         :empty-lines 1
         :kill-buffer t)))
#+end_src

*** Agenda Window Behavior

=org-agenda-window-setup= setting specifies how the agenda buffer should be
displayed. Setting ~'only-window~ shows the agenda in in full screen. Setting
=org-agenda-restore-windows-after-quit= to ~t~ restores the window configuration
after exiting the agenda view.

#+begin_src emacs-lisp 
(setopt org-agenda-window-setup 'only-window
        org-agenda-restore-windows-after-quit t)
#+end_src

*** Agenda Log Settings

In =org=, it is possible to track TODO state changes on a per-keyword basis by
adding ~!~ and/or ~@~ to record a timestamp or note, respectively.

=org-log-into-drawer= setting, when set to ~t~, stores logs in a =drawer= below the
heading. This improves readability by separating state-change notes in a
separate (collapsible) area. Setting =org-log-states-order-reversed= to ~nil~ means
the latest note entry will be located at the bottom of the list.

#+begin_src emacs-lisp 
(setopt org-log-into-drawer t
        org-log-states-order-reversed nil)
#+end_src

*** Agenda TODO Settings
**** Fast TODO Selection
:PROPERTIES:
:ID:       bc0babe0-495f-4c4d-bedc-3e079930e57a
:END:

=org-use-fast-todo-selection= setting, when set to ~'auto~, enables the fast
selection of TODO states; calling ~M-x org-todo~ (~C-c C-t~) will open a pop-up
menu showing the available TODO keywords, each assigned to a specific key.

#+begin_src emacs-lisp 
(setopt org-use-fast-todo-selection 'auto)
#+end_src

*** Agenda TAG Settings
**** Fast Tag Selection

Similar to [[id:bc0babe0-495f-4c4d-bedc-3e079930e57a][Fast TODO Selection]], setting =org-use-fast-tag-selection= to ~'auto~
opens a TAG pop-um menu when calling ~M-x org-set-tags-command~ (~C-c C-q~).

#+begin_src emacs-lisp 
(setopt org-use-fast-tag-selection 'auto)
#+end_src

**** Align Tags

=org-auto-align-tags= setting, when set to ~t~, keeps tags aligned when modifying
headlines.

#+begin_src emacs-lisp 
(setopt org-auto-align-tags t)
#+end_src

*** Agenda View
**** Hide Tags in Agenda View

=org-agenda-remove-tags= setting, when set to ~t~, removes tags from the headline
copy in the agenda.

#+begin_src emacs-lisp 
(setopt org-agenda-remove-tags t)
#+end_src

**** Modernize Org-Agenda

=org-super-agenda= is an Emacs package providing =org-super-agenda-mode= that, when
activated, enhances the =agenda-view= via customize-able grouping and filtering
options (implemented in [[id:dd0e3646-9554-4b81-89cc-e48e2dd485bc][Agenda Custom Commands]]).

#+begin_src emacs-lisp 
(use-package org-super-agenda
  :defer t
  :after org
  :hook (org-agenda-mode . org-super-agenda-mode)
  :custom (org-super-agenda-header-prefix " ")
  :config
  (set-face-attribute 'org-super-agenda-header nil :weight 'bold))
#+end_src

**** Agenda Custom Commands
:PROPERTIES:
:ID:       dd0e3646-9554-4b81-89cc-e48e2dd485bc
:END:

#+begin_src emacs-lisp 
(setq org-agenda-custom-commands
      '(("e" "Personal Emacs Tasks"
         ((alltodo "" ((org-agenda-overriding-header "Emacs TODOs")
                       (org-super-agenda-groups '((:discard (:not (:tag ("personal" "emacs"))))
                                                  (:discard (:tag "work"))
                                                  (:auto-property "project")))))))))
#+end_src

** Provide init-org.el

#+begin_src emacs-lisp
(provide 'init-org)
;;; init-org.el ends here
#+end_src

* Completion
:PROPERTIES:
:header-args: :tangle modules/init-completion.el
:END:

#+begin_src emacs-lisp :noweb yes :comments no
<<header(FILENAME="init-completion.el")>>
#+end_src

