README.org
** Dired

=dired=, short for "DIsk REDitor", is a /built-in/ Emacs package providing an
interface for file and directory management. With =dired=, it is possible to
navigate directories, view file details, and perform a wide range of file
operations directly within Emacs.

#+begin_src emacs-lisp 
(use-package dired
  :ensure nil
  :commands dired
  :custom
  ;; -A :: Show hidden files but omit implied '.' and '..' targets
  ;; -h :: Make file sizes human-readable
  ;; -l :: Produce long=g, detailed listing (required by 'dired')
  ;; -v :: Sort file by version number
  ;; --group-directories-first :: List directories at top of buffer
  ;; --time-style=long-iso     :: List %Y-%m-%d %H:%M
  (dired-listing-switches (concat "-Ahlv"
                                  " --group-directories-first"
                                  " --time-style=long-iso"))

  ;; Refresh 'dired' buffer if directory changes
  (dired-auto-revert-buffer #'dired-buffer-changed-p)

  ;; If two 'dired' buffers open side-by-side, Emacs will suggest the
  ;; other buffer directory when moving files
  (dired-dwim-target t)

  :config
  ;; The variable 'dired-kill-when-opening-new-dired-buffer'
  ;; exists. However, there are use-cases for having multiple 'dired'
  ;; buffers open at the same time (see 'dired-dwim-target').
  (defun jh/dired-kill-all-buffers ()
    "Delete all open 'dired'-mode buffers."
    (interactive)
    (jh/kill-buffers-by-mode 'dired-mode)))
#+end_src

** Extended Dired Features

=dired-x= is a /built-in/ Emacs package providing extended and optional features to
=dired= including, but not limited to:

+ Omitted files :: =dired-omit-mode= tidies the =dired= buffer by hiding files
  based on regex patterns

+ Jumping to files :: Adds commands to quickly jump to files or directories in
  a project

#+begin_src emacs-lisp 
(use-package dired-x
  :ensure nil
  :after dired
  ;; ':commands dired' removed in commit 67d0400
  :custom
  ;; Files to ignore in 'dired' buffer.
  (dired-omit-files (concat "\\`[.]?#\\|\\`[.][.]?\\'"
                            "\|"
                            (rx (or (: bos (or "\.DS_Store"
                                               "__MACOSX"
                                               "\.git")
                                       eos)
                                    (: bos "__pycache__")
                                    ".ipynb_checkpoints"
                                    "\.~.*#"))))
  :config
  ;; Must activate 'dired-omit-mode' to omit 'dired-omit-files'.
  (add-hook 'dired-after-readin-hook 'dired-omit-mode))
#+end_src

** Auxiliary Dired Functions

=dired-aux= is a /built-in/ Emacs package providing auxiliary functions in
=dired=. The additional functionality includes, but is not limited to:

+ Bulk operations :: Handle operations on multiple files more robustly, such as
  renaming and copying

+ File compression and decompression :: Adds commands for compressing and
  decompressing files directly from a =dired= buffer

+ Backup and auto-save file cleanup :: Includes features to clean up backup
  files and other temporary files more effectively

#+begin_src emacs-lisp 
(use-package dired-aux
  :ensure nil
  :after dired
  :commands dired
  :bind (:map dired-mode-map
              ;; 'f' calls 'dired-find-file'
              ("F" . dired-create-empty-file))
  :custom
  (dired-do-revert-buffer t "Revert buffer after any 'dired-do' operations"))
#+end_src

** Writable Dired Buffers

=wdired= is a /built-in/ Emacs package providing the ability to make =dired=-buffers
_writable_. In other words, it is possible to edit file and directory names as if
they are regular text. This is advantageous for quickly renaming multiple
files.

#+begin_src emacs-lisp 
(use-package wdired
  :ensure nil
  :after dired
  :commands dired
  :custom
  ;; Change permission using 'SPC'
  (wdired-allow-to-change-permissions t))
#+end_src

** Provide init-dired.el

#+begin_src emacs-lisp 
(provide 'init-dired)
;;; init-dired.el ends here
#+end_src

* Development
:PROPERTIES:
:header-args: :tangle modules/init-dev.el
:END:

#+begin_src emacs-lisp :noweb yes :comments no
<<header(FILENAME="init-dev.el")>>
#+end_src

** Rainbow Delimiters

=rainbow-delimiters= is an Emacs package providing =rainbow-delimiters-mode= that,
when activated, improves code readability by visually distinguishing pairs of
delimiters using different colors.

#+begin_src emacs-lisp 
(use-package rainbow-delimiters
  :hook (prog-mode))
#+end_src

** Highlight TODOs
:PROPERTIES:
:ID:       5e72d5f0-fdaf-491a-9a84-9806ee295d0a
:END:
:RELATED:
+ [[id:1ae14e20-459c-44ec-8c2a-b5f2f64116ac][Highlighting]]
:END:

=hl-todo= is an Emacs package providing =hl-todo-mode= that, when activated,
highlight TODO keywords in text files. Since =org= includes TODO tags, we will
only activate in =prog-mode=.

*Notable functions:*
+ hl-todo-next :: Jump to next TODO-keyword
+ hl-todo-previous :: Jump to previous TODO-keyword
+ hl-toqdo-occur :: Open ibuffer of all occurrences

#+begin_src emacs-lisp 
(use-package hl-todo
  :hook (prog-mode)
  :custom
  (hl-todo-keyword-faces
   '(("TODO"   . "#FFBF00")
     ("FIXME"  . "#DE3163"))))
#+end_src

** Expand Region Selection

=expand-region= is an Emacs package that provides the ability to incrementally
expand a selected region of text. Calling ~er/expand-region~ selects an initial
region; ~=~ and ~-~ can then be used to expand or contract the selected region.

*N.B.* The package includes =python-mode-expandsions.el= and other modules that may
be of interest.

#+begin_src emacs-lisp 
(use-package expand-region
  :commands er/expand-region
  :bind ("C-=" . er/expand-region))
#+end_src

** Project Navigation

=projectile= is an Emacs package providing =projectile-mode= that, when activated,
provides functionality to more quickly navigate, manage, and work with files
within a repository.

#+begin_src emacs-lisp 
;; To provide project management + navigation features
(use-package projectile
  :init (projectile-mode 1)
  :custom
  ;; Cache to prevent slow 'projectile-find-file' on larger projects
  (projectile-enable-caching t)
  :bind (:map projectile-mode-map
              ("C-c p" . projectile-command-map)))
#+end_src

** Version Control
*** Magit

=magit= is an Emacs package that provides a text-based user interface to =git=
(otherwise referred to as a "git porcelain"). See [[https://magit.vc/][magit.vc]] for documentation.

#+begin_src emacs-lisp 
(use-package magit
  :bind ("C-x g" . magit-status)
  :diminish magit-minor-mode
  :hook (git-commit-mode . (lambda () (setq fill-column 72)))
  :mode ("/\\.gitmodules\\'" . conf-mode)
  :custom
  ;; hide ^M chars at the end of the line when viewing diffs
  (magit-diff-hide-trailing-cr-characters t)

  ;; Limit legth of commit message summary
  (git-commit-summary-max-length 50)

  ;; Open status buffer in same buffer
  (magit-display-buffer-function 'magit-display-buffer-same-window-except-diff-v1)
  :config
  ;; Must define here to ensure underlying function defined in
  ;; 'init-emacs' is loaded before 'magit'.
  (defun my/magit-kill-all-buffers ()
    "Kill all buffers derived from 'magit-mode'."
    (interactive)
    (my/kill-buffers-by-mode 'magit-mode)))
#+end_src

*** Tweaks for CLI Git in Emacs

Command-line =git= is possible in =vterm=, however editing =EDITMSG= buffers can be
tedious. Since ~core.editor vim~ is set by default, =vim= bindings are required to
edit the message buffer. However, setting ~core.editor "emacs"~ will open the
=EDITMSG= buffer as a new window instead of in the current Emacs
instance. *Annoying!*

Alternatively we can install the =with-editor= package (part of =magit=) to open
the =EDITMSG= buffer inside the current Emacs instance and set ~git config
--global core.editor "emacsclient"~ to use Emacs bindings when editing the
message. See [[https://magit.vc/manual/with-editor/Using-With_002dEditor-commands.html][magit.vc/manual/with-editor]].

#+begin_src emacs-lisp 
(use-package with-editor
  :after (vterm magit)
  :commands vterm
  :config
  ;; To use current Emacs instance as "the editor" in 'vterm'
  (add-hook 'vterm-mode-hook 'with-editor-export-editor)

  ;; Activate 'with-editor' for several git message buffers
  (add-to-list 'auto-mode-alist
               '("/\\(?:COMMIT\\|NOTES\\|TAG\\|PULLREQ\\)_EDITMSG\\'"
                 . with-editor-mode))

  ;; To use Emacs bindings in the EDITMSG buffer
  (shell-command "git config --global core.editor emacsclient"))
#+end_src

*** Git-Gutter

=git-gutter= is an Emacs package providing =git-gutter-mode= that, when activated,
provides visual indication of changes to files inside a =git= repository. Colored
icons located in the gutter indicate which lines have been modified, added, or
deleted since the previous commit.

*N.B.* The mode does not play nice with =linum-mode=, so we must also install the
=git-gutter-fringe= package (see [[id:253507fc-cbf8-40a5-a490-c8651a7d44dd][Display Line Numbers in Fringe]]).

#+begin_src emacs-lisp 
(use-package git-gutter
  :hook ((prog-mode org-mode) . git-gutter-mode)
  :custom
  (git-gutter:modified-sign "=")
  (git-gutter:added-sign "+")
  (git-gutter:deleted-sign "-")
  :bind (("C-x P" . git-gutter:previous-hunk)
         ("C-x N" . git-gutter:next-hunk)
         ("C-x G" . git-gutter:popup-hunk))
  :config
  (use-package git-gutter-fringe
    :commands git-gutter-mode
    :config (global-git-gutter-mode)))
#+end_src

** Virtual Terminal

=vterm= is an Emacs package providing a terminal emulator inside Emacs. Based on
=libvterm=, a C library that enables near-native terminal performance.

#+begin_src emacs-lisp 
(use-package vterm
  :defer t
  :commands vterm
  ;; Requires compilation, which may not work without installing dependencies
  :init (setopt vterm-always-compile-module t)
  :config
  (defun my/vterm-new ()
  "Prompt the user for a new vterm buffer name and open it."
  (interactive)
  (let ((vterm-buffer-name (read-string "Enter new vterm buffer name: ")))
    (vterm (generate-new-buffer-name (concat "*" vterm-buffer-name "*"))))))
#+end_src

** Lisp
*** Automatic Indentation

=aggressive-indent= is an Emacs package providing =aggressive-indent-mode= that,
when activated, correctly indents code as you type. Changes to indentation on
one line of a function, for example, automatically adjusts the remaining lines
of code. Primarily used as a "dumb" formatter for =emacs-lisp= code.

*N.B.* Less important for =python= as other code formatter packages exist.

#+begin_src emacs-lisp 
(use-package aggressive-indent
  :hook (emacs-lisp-mode))
#+end_src

*** Elisp Documentation Lookup

=helpful= is an Emacs package extends the /built-in/ =help= package and
provides efficient, user-friendly documentation for =emacs-lisp=
functions, variables, keybindings, and more.

#+begin_src emacs-lisp 
(use-package helpful
  :bind
  (("C-h k" . helpful-kill-buffers)
    ("C-h j" . helpful-at-point)
    ("C-h f" . helpful-callable)
    ("C-h F" . helpful-function)
    ("C-h v" . helpful-variable)
    ("C-h k" . helpful-key)
    ("C-h c" . helpful-command)
    ("C-h m" . helpful-mode)
    ("C-h M" . describe-macro))
  :config
  ;; Must define here to ensure underlying function defined in
  ;; 'init-emacs' is loaded before 'helpful'.
  (defun my/helpful-kill-all-buffers ()
    (interactive)
    (my/kill-buffers-by-mode 'help-mode 'helpful-mode)))
#+end_src

** Yaml

#+begin_src emacs-lisp 
(use-package yaml-mode
  :mode ("\\.yml\\'" "\\.yaml\\'"))
#+end_src

** Provide init-dev.el

#+begin_src emacs-lisp 
(provide 'init-dev)
;;; init-dev.el ends here
#+end_src

* Writing
:PROPERTIES:
:header-args: :tangle modules/init-writing.el
:END:

#+begin_src emacs-lisp :noweb yes :comments no
<<header(FILENAME="init-writing.el")>>
#+end_src

** Improve Navigation

=avy= is an Emacs package providing efficient navigation by allowing users to
jump to visible text within the buffer.

#+begin_src emacs-lisp 
(use-package avy
  :bind (("M-j" . avy-goto-char-timer)  ;; orig. 'default-indent-new-line'
         :map isearch-mode-map
         ("M-j" . avy-isearch))
  :custom
  (avy-timeout-seconds 0.3 "Seconds before overlay appears")
  (avy-style 'pre "Overyly single char at beginning of word")
  :custom-face
  ;; Change colors to improve readability
  (avy-lead-face ((t (:background "#000000" :foreground "#33A4FF" :weight bold)))))
#+end_src

