README.org
** Spell Checking
:PROPERTIES:
:ID:       8a9a6083-929e-4329-b009-c33529b0e5a7
:END:

Spell checking is important for both things like narratives and git
commits. The [[https://github.com/minad/jinx][jinx]] package is preferred over the builtin =flyspell= due to
efficiency, keybindings, and ability to save words to a dictionary.

The package uses the API of the =Enchant= library [[[https://abiword.github.io/enchant/][github/enchant]]] and only
analyses visible text (instead of the entire buffer). The =jinx= package requires
the following local packages to provide spell-checking. Both =enchant= and
=pkgconf= are Arch-specific. Dictionaries are provided by =nuspell= (the modern
version of =hunspell=). See [[https://github.com/minad/jinx][gitub/jinx]] for more details. In Arch, packages can be
download by ~yay enchant pkgconf hunspell~.

  + hunspell :: Spell-checker dictionaries
  + enchant :: Wrapper for spelling libraries
  + pkgconf :: Compiler; used by =jinx= to locate =enchant=

Useful commands include:
  + jinx-next / jinx-previous :: Jump to previous/next visible
    spelling error
  + jinx-correct-all :: Allow user to correct all spelling errors in
    buffer

*QUIRK:* Comments in =src-blocks= are only checked if viewed in an =org-edit-special=
buffer accessed via ~C-c '~ . This is because =jinx= only checks text possessing
specific face properties (see ~jinx-include-faces~ and ~jinx-exclude-faces~). When
coding, we are only interested in checking comments and doc-strings;
~tree-sitter-hl-face:comment~, for example extends this functionality to =.py=
files. To check a comment, we would need to remove =org-block= in
~jinx-exclude-faces~ at the expense of checking ALL of the code.

#+begin_src elisp 
(use-package jinx
  :hook (org-mode text-mode prog-mode conf-mode)
  :bind (("C-c j c" . jinx-correct)
         ("C-c j a" . jinx-correct-all)
         ("C-c j d" . my/jinx-save-word-at-point))
  :custom
  ;; 'jinx-mode' only checks text possessing specific face properties like
  ;; 'font-lock-comment-face' in 'prog-mode' for example.
  (jinx-include-faces
   '((yaml-mode . conf-mode)
     (yaml-ts-mode . conf-mode)
     ;; Only check docstrings and comments; not strings
     (conf-mode font-lock-comment-face)
     (prog-mode font-lock-comment-face
                font-lock-doc-face
                tree-sitter-hl-face:comment
                tree-sitter-hl-face:doc)))

  (jinx-languages "en_GB")
  :config
  ;; Quickly save word-at-point to dictionary used by 'jinx'
  (defalias 'my/jinx-save-word-at-point (kmacro "C-c j c @ RET"))

  ;; 'jinx-correct' suggestions displayed as grid instead of long list
  (vertico-multiform-mode 1)
  (add-to-list 'vertico-multiform-categories
               '(jinx grid (vertico-grid-annotate . 20))))
#+end_src

** Denote
*** Denote
:PROPERTIES:
:ID:       7fed44cb-7196-48f4-9708-b6012d1c6c5d
:END:

=denote= is an Emacs package that helps users manage and organize their notes
more effectively.

Related notes:
+ [[denote:20241010T181237][How To Use Denote]]

#+begin_src emacs-lisp 
(use-package denote
  :after org
  :commands denote
  :hook (dired-mode . denote-dired-mode)
  :custom
  (denote-directory (concat my-persist-dir "notes/"))
  (denote-file-type "org")
  (denote-prompts '(title keywords))
  (denote-known-keywords '("emacs" "python" "linux" "ml" "work"))
  ;; TODO: use separate templates for coding/ect
  (denote-templates nil)
  (denote-org-front-matter (concat "#+TITLE: %1$s\n"
                                   "#+DATE: %2$s\n"
                                   "#+ID: %4$s\n"
                                   "#+FILETAGS: %3$s\n"
                                   "#+STARTUP: overview\n")))
#+end_src

*** Update dblocks Before Saving

=denote= takes advantage of dynamic =org-blocks= to dynamically organize links and
back-links. Annoyingly, they must be manually updated. Here, we add a hook to
update dynamic blocks before saving the =denote= buffer.

#+begin_src emacs-lisp 
(add-hook 'before-save-hook (lambda ()
                              (when (denote-file-is-note-p (buffer-file-name))
                                (org-update-all-dblocks))))
#+end_src

*** Consult-Denote Extension
:PROPERTIES:
:ID:       614d6cd5-6eb8-40cc-8ed1-538bcdca253d
:END:
:RELATED:
+ [[id:8b393fcc-9d43-4afb-b249-9a72bc6089ea][Consult]]
:END:

=consult-denote= is an Emacs accessory package for =denote= that extends the
preview-functionality of =consult=.  The package provides the following
functions:

+ consult-denote-find :: Alternative to ~denote-open-or-create~
+ consult-denote-grep :: Regex to filter files in =denote-directory=

#+begin_src emacs-lisp 
(use-package consult-denote
  :after (consult denote)
  :commands (consult-denote-find))
#+end_src

** Provide init-writing.el

#+begin_src emacs-lisp 
(provide 'init-writing)

;;; init-writing.el ends here
#+end_src

* Keybindings
:PROPERTIES:
:header-args: :tangle modules/init-kbd.el
:END:

#+begin_src emacs-lisp :noweb yes :comments no
<<header(FILENAME="init-kbd.el")>>
#+end_src

** Which-Key

=which-key= is an Emacs package providing the minor-mode =which-key-mode= that,
when activated, displays the available keybindings following an incomplete
command [[[https://github.com/justbur/emacs-which-key][github/whichkey]]]. For example, typing ~C-x~ will open a window showing
available keybindings (and descriptions) sharing the ~C-x~ prefix.

*N.B.* After popup window appears, use ~C-h~ to open additional navigation
options. This is helpful not all keybindings can fit in the popup window.

#+begin_src emacs-lisp 
(use-package which-key
  :config (which-key-mode)
  :custom
  (which-key-show-early-on-C-h t     "Trigger which-key manually")
  (which-key-idle-delay 0.5          "Delay before popup appears")
  (which-key-idle-second-delay 0.05  "Responsiveness after triggered")
  (which-key-popup-type 'minibuffer  "Where to show which-key")
  (which-key-max-display-columns nil "N-cols determined from monotor")
  (which-key-separator "  "         "ex: C-x DEL backward-kill-sentence")
  (which-key-add-column-padding 1    "Padding between columns of keys")
  (which-key-show-remaining-keys t   "Show count of keys in modeline"))
#+end_src

** Crux
:PROPERTIES:
:ID:       28b8a358-e893-4390-a882-7239a36efcd4
:END:
:RELATED:
+ [[id:d831e4e4-e9b1-480e-aa1a-a152d9707275][General.el]]
:END:

=crux= ("Collection of Ridiculously Useful eXtensions") is an Emacs package that
bundles many useful interactive commands to enhance the Emacs experience. There
are many functions [[[https://github.com/bbatsov/crux/blob/master/crux.el][github.com/crux]]] to choose from.

Below, we add a number of useful functions:
  + crux-move-beginning-of-line :: Move point to indentation of line
  + crux-kill-line-backwards :: Kill line backwards and adjust the indentation
  + crux-switch-to-previous-buffer :: Switch to previously opened buffer
  + crux-view-url :: Open new buffer containing contents of URL

#+begin_src emacs-lisp 
(use-package crux
  :commands (crux-move-beginning-of-line
             crux-kill-whole-line
             crux-switch-to-previous-buffer
             crux-kill-line-backwards)
  :bind (("C-a" . 'crux-move-beginning-of-line)
         ([remap kill-whole-line] . 'crux-kill-whole-line)
         ("M-o" . 'crux-switch-to-previous-buffer)
         ("C-<backspace>" . 'crux-kill-line-backwards)
         ("C-c 3" . 'crux-view-url)))
#+end_src

** Global Bindings
:PROPERTIES:
:ID:       77a39f08-8fcf-4b4f-b7c4-aef965d87cab
:END:
:RELATED:
+ [[id:d831e4e4-e9b1-480e-aa1a-a152d9707275][General.el]]
:END:

#+begin_src emacs-lisp 
;; 'Find-File-At-Point' package adds additional functionality to
;; existing keybindings
(ffap-bindings)

(global-set-key (kbd "C-+") 'text-scale-increase)
(global-set-key (kbd "C--") 'text-scale-decrease)
(global-set-key (kbd "C-x O") 'my/jump-to-minibuffer)
(global-set-key (kbd "C-x M-k") 'kill-current-buffer)
#+end_src

** General.el
:PROPERTIES:
:ID:       d831e4e4-e9b1-480e-aa1a-a152d9707275
:END:
:RELATED:
+ [[id:453fdeac-b2bb-4217-9803-d5c89ceaf6de][Custom Buffer Functions]]
+ [[id:8f4885df-ad58-432b-a6cd-1f4524bfc868][Custom Functions]]
+ [[id:28b8a358-e893-4390-a882-7239a36efcd4][Crux]]
+ [[id:77a39f08-8fcf-4b4f-b7c4-aef965d87cab][Global Bindings]]
:END:

=general= is an Emacs package is a keybinding management library that allows
users to setup global and local keybindings more easily.

#+BEGIN_src emacs-lisp 
(use-package general
  :custom
  (general-describe-priority-keymaps nil)
  (general-describe-keymap-sort-function 'general-sort-by-car)
  (general-describe-keybinding-sort-function 'general-sort-by-car)

  :config
  ;; Good to unset before assigning to 'my-leader-def'
  (global-unset-key (kbd "M-m"))

  (general-create-definer my-leader-def
    :keymaps 'global
    :prefix "M-m"))

;; :ignore t to define sub-section headers
(my-leader-def

 "i" '(my/eval-init :which-key "eval-init")

 ;; BUFFERS
 "b"  '(:ignore t                        :which-key "buffer")
 "bn" '(my/kill-buffer-name              :which-key "copy-buff-name")
 "bp" '(my/kill-relative-buffer-path     :which-key "copy-buff-path")
 "bl" '(my/kill-buffer-orgmode-file-link :which-key "create-buff-orgmode-link")
 "bi" '(crux-find-user-init-file         :which-key "jump-to-init")
 "bc" '(my/find-config-file              :which-key "jump-to-config")
 "bm" '(my/jump-to-minibuffer            :which-key "jump-to-minibuff")
 "bf" '(ffap-other-window                :which-key "find-file-other-window")

 ;; KILL BUFFERS
 "k"  '(:ignore t                          :which-key "killing")
 "ka" '(my/kill-all-buffers-except-scratch :which-key "kill-buffers-except-scratch")
 "ke" '(crux-kill-other-buffers            :which-key "crux-kill-other-buffers")
 "km" '(my/magit-kill-all-buffers          :which-key "kill-magit-buffs")
 "kh" '(my/helpfull-kill-all-buffers       :which-key "kill-helpful-buffs")
 "kd" '(my/dired-kill-all-buffers          :which-key "kill-dired-buffs"))
#+end_src

** Provide init-kbd.el

#+begin_src emacs-lisp 
(provide 'init-kbd)
;;; init-kbd.el ends here
#+end_src

* Load Modules
:PROPERTIES:
:ID:       8b5ba82d-d303-4970-ade6-39f82fc08b56
:header-args: :tangle init.el
:END:

Finally, we specify the packages (ie top-level org-headers) to be included in
our configuration.

#+begin_src emacs-lisp
(add-to-list 'load-path (expand-file-name "modules" user-emacs-directory))

(require 'init-emacs)
(require 'init-ui)
(require 'init-org)
(require 'init-completion)
(require 'init-dired)
(require 'init-dev)
(require 'init-writing)
(require 'init-kbd)
;;; init.el ends here
#+end_src
